particle-iot/device-os/hal/src/nRF52840/usart_hal.cpp
        return 0;
    }

    int end() {
        CHECK_TRUE(enabled_, SYSTEM_ERROR_INVALID_STATE);
        AtomicSection lk;

        disableInterrupts();

        stopTransmission();
        stopReceiver();

        nrf_uarte_disable(uarte_);

        nrf_uarte_txrx_pins_disconnect(uarte_);
        nrf_uarte_hwfc_pins_disconnect(uarte_);

        HAL_Pin_Mode(txPin_, INPUT);
        HAL_Set_Pin_Function(txPin_, PF_NONE);
        HAL_Pin_Mode(rxPin_, INPUT);
        HAL_Set_Pin_Function(rxPin_, PF_NONE);

        if (config_.config & SERIAL_FLOW_CONTROL_CTS) {
            HAL_Pin_Mode(ctsPin_, INPUT);
            HAL_Set_Pin_Function(ctsPin_, PF_NONE);
        }
        if (config_.config & SERIAL_FLOW_CONTROL_RTS) {
            HAL_Pin_Mode(rtsPin_, INPUT);
            HAL_Set_Pin_Function(rtsPin_, PF_NONE);
        }

        nrfx_prs_release(uarte_);

        disableTimer();

        enabled_ = false;
        config_ = {};
        transmitting_ = false;
        receiving_ = 0;
        rxBuffer_.reset();
        txBuffer_.reset();

        return 0;
    }

    ssize_t data() {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        RxLock lk(uarte_);
        ssize_t d = rxBuffer_.data();
        if (receiving_) {
            const ssize_t toConsume = timerValue() - rxConsumed_;
            if (toConsume > 0) {
                rxBuffer_.acquireCommit(toConsume);
                rxConsumed_ += toConsume;
                d += toConsume;
            }
        }
        return d;
    }

    ssize_t space() {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        TxLock lk(uarte_);
        return txBuffer_.space();
    }

    ssize_t read(uint8_t* buffer, size_t size) {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        const ssize_t maxRead = CHECK(data());
        const size_t readSize = std::min((size_t)maxRead, size);
        CHECK_TRUE(readSize > 0, SYSTEM_ERROR_NO_MEMORY);
        ssize_t r;
        {
            RxLock lk(uarte_);
            r = CHECK(rxBuffer_.get(buffer, readSize));
        }
        if (!receiving_) {
            startReceiver();
        }
        return r;
    }

    ssize_t peek(uint8_t* buffer, size_t size) {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        const ssize_t maxRead = CHECK(data());
        const size_t peekSize = std::min((size_t)maxRead, size);
        CHECK_TRUE(peekSize > 0, SYSTEM_ERROR_NO_MEMORY);
        RxLock lk(uarte_);
        return rxBuffer_.peek(buffer, peekSize);
    }

    ssize_t write(const uint8_t* buffer, size_t size) {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        const ssize_t canWrite = CHECK(space());
        const size_t writeSize = std::min((size_t)canWrite, size);
        CHECK_TRUE(writeSize > 0, SYSTEM_ERROR_NO_MEMORY);
        ssize_t r;
        {
            TxLock lk(uarte_);
            r = CHECK(txBuffer_.put(buffer, writeSize));
        }
        // Start transmission
        startTransmission();
        return r;
    }

    ssize_t flush() {
        while (true) {
            while (transmitting_) {
                // FIXME: busy loop
            }
            {
                TxLock lk(uarte_);
                if (!enabled_ || txBuffer_.empty()) {
                    break;
                }
            }
        }
        return 0;
    }

    bool isConfigured() const {
        return configured_;
    }

    bool isEnabled() const {
        return enabled_;
    }

    void pump() {
        if (!willPreempt() && isEnabled()) {
            interruptHandler();
        }
    }

    void interruptHandler() {
        BaseType_t yield = pdFALSE;
        bool eventGenerated = false;

        if (nrf_uarte_int_enable_check(uarte_, NRF_UARTE_INT_RXDRDY_MASK)) {
            if (nrf_uarte_event_check(uarte_, NRF_UARTE_EVENT_RXDRDY)) {
                nrf_uarte_int_disable(uarte_, NRF_UARTE_INT_RXDRDY_MASK);
                nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_RXDRDY);
                if (xEventGroupSetBitsFromISR(evGroup_, HAL_USART_PVT_EVENT_READABLE, &yield) != pdFAIL) {
                    eventGenerated = true;
                }
            }
        }

        if (nrf_uarte_int_enable_check(uarte_, NRF_UARTE_INT_TXDRDY_MASK)) {
            if (nrf_uarte_event_check(uarte_, NRF_UARTE_EVENT_TXDRDY)) {
                nrf_uarte_int_disable(uarte_, NRF_UARTE_INT_TXDRDY_MASK);
                nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_TXDRDY);
                BaseType_t yieldTx = pdFALSE;
                if (xEventGroupSetBitsFromISR(evGroup_, HAL_USART_PVT_EVENT_WRITABLE, &yieldTx) != pdFAIL) {
                    eventGenerated = true;
                }
                yield = yield || yieldTx;
            }
        }

        if (nrf_uarte_event_check(uarte_, NRF_UARTE_EVENT_ENDRX)) {
            nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_ENDRX);
            nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_RXDRDY);

            nrf_timer_task_trigger(timer_, NRF_TIMER_TASK_CLEAR);
            rxConsumed_ = 0;

            if (rxBuffer_.acquirePending() > 0) {
                rxBuffer_.acquireCommit(rxBuffer_.acquirePending());
            }

            --receiving_;
            startReceiver();
            return;
        }
        if (nrf_uarte_event_check(uarte_, NRF_UARTE_EVENT_ENDTX)) {
            nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_ENDTX);
            nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_TXDRDY);
            txBuffer_.consumeCommit(nrf_uarte_tx_amount_get(uarte_));
            transmitting_ = false;
            startTransmission();
        }
        if (nrf_uarte_event_check(uarte_, NRF_UARTE_EVENT_ERROR)) {
            nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_ERROR);
            uint32_t uartErrorSource = nrf_uarte_errorsrc_get_and_clear(uarte_);
            (void)uartErrorSource;
        }

        if (eventGenerated) {
            portYIELD_FROM_ISR(yield);
        }
    }

    EventGroupHandle_t eventGroup() {
        return evGroup_;
    }

    int enableEvent(HAL_USART_Pvt_Events event) {
        if (event & HAL_USART_PVT_EVENT_READABLE) {
            if (data() <= 0) {
                nrf_uarte_int_disable(uarte_, NRF_UARTE_INT_RXDRDY_MASK);
                nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_RXDRDY);
                nrf_uarte_int_enable(uarte_, NRF_UARTE_INT_RXDRDY_MASK);
            } else {
                xEventGroupSetBits(evGroup_, HAL_USART_PVT_EVENT_READABLE);
            }
        }

        if (event & HAL_USART_PVT_EVENT_WRITABLE) {
            if (space() <= 0) {
                nrf_uarte_int_disable(uarte_, NRF_UARTE_INT_TXDRDY_MASK);
                nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_TXDRDY);
                nrf_uarte_int_enable(uarte_, NRF_UARTE_INT_TXDRDY_MASK);
            } else {
                xEventGroupSetBits(evGroup_, HAL_USART_PVT_EVENT_WRITABLE);
            }
        }

        return SYSTEM_ERROR_NONE;
    }

    int disableEvent(HAL_USART_Pvt_Events event) {
        if (event & HAL_USART_PVT_EVENT_READABLE) {
            nrf_uarte_int_disable(uarte_, NRF_UARTE_INT_RXDRDY_MASK);
            xEventGroupClearBits(evGroup_, HAL_USART_PVT_EVENT_READABLE);
        }

        if (event & HAL_USART_PVT_EVENT_WRITABLE) {
            nrf_uarte_int_disable(uarte_, NRF_UARTE_INT_TXDRDY_MASK);
            xEventGroupClearBits(evGroup_, HAL_USART_PVT_EVENT_WRITABLE);
        }

        return SYSTEM_ERROR_NONE;
    }

    int waitEvent(uint32_t events, system_tick_t timeout) {
        CHECK(enableEvent((HAL_USART_Pvt_Events)events));

        auto res = xEventGroupWaitBits(evGroup_, events, pdTRUE, pdFALSE, timeout / portTICK_RATE_MS);
        return res;
    }

